In [1]:
import numpy as np
import pandas as pd

In [10]:
havaSozluk={"Istanbul":[30,28,np.nan,np.nan],"Bursa":[np.nan,29,24,28],"Erzurum":[20,18,21,25],"Antalya":[32,np.nan,35,np.nan]}

In [11]:
havaDurumu=pd.DataFrame(havaSozluk)

In [12]:
havaDurumu

   Istanbul  Bursa  Erzurum  Antalya
0      30.0    NaN       20     32.0
1      28.0   29.0       18      NaN
2       NaN   24.0       21     35.0
3       NaN   28.0       25      NaN

In [13]:
havaDurumu.dropna(axis=1,thresh=3) # Kolon içerisinde 3 veya daha fazla NaN Harici veri olmayan kısımlar silindi

   Bursa  Erzurum
0    NaN       20
1   29.0       18
2   24.0       21
3   28.0       25

In [14]:
havaDurumu

   Istanbul  Bursa  Erzurum  Antalya
0      30.0    NaN       20     32.0
1      28.0   29.0       18      NaN
2       NaN   24.0       21     35.0
3       NaN   28.0       25      NaN

In [15]:
havaDurumu.fillna(100) # Nan(eksik veri) değerleri 100 e eşitlendi

   Istanbul  Bursa  Erzurum  Antalya
0      30.0  100.0       20     32.0
1      28.0   29.0       18    100.0
2     100.0   24.0       21     35.0
3     100.0   28.0       25    100.0